node {
  name: "ReadFile/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled1.jpg"
      }
    }
  }
}
node {
  name: "ReadFile"
  op: "ReadFile"
  input: "ReadFile/filename"
}
node {
  name: "DecodeJpeg"
  op: "DecodeJpeg"
  input: "ReadFile"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg"
  input: "resize_images/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images/ExpandDims"
  input: "resize_images/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images/Squeeze"
  op: "Squeeze"
  input: "resize_images/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_1/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled10.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_1"
  op: "ReadFile"
  input: "ReadFile_1/filename"
}
node {
  name: "DecodeJpeg_1"
  op: "DecodeJpeg"
  input: "ReadFile_1"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_1/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_1"
  input: "resize_images_1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_1/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_1/ExpandDims"
  input: "resize_images_1/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_1/Squeeze"
  op: "Squeeze"
  input: "resize_images_1/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_2/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled100.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_2"
  op: "ReadFile"
  input: "ReadFile_2/filename"
}
node {
  name: "DecodeJpeg_2"
  op: "DecodeJpeg"
  input: "ReadFile_2"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_2/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_2/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_2"
  input: "resize_images_2/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_2/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_2/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_2/ExpandDims"
  input: "resize_images_2/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_2/Squeeze"
  op: "Squeeze"
  input: "resize_images_2/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_3/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled11.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_3"
  op: "ReadFile"
  input: "ReadFile_3/filename"
}
node {
  name: "DecodeJpeg_3"
  op: "DecodeJpeg"
  input: "ReadFile_3"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_3/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_3/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_3"
  input: "resize_images_3/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_3/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_3/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_3/ExpandDims"
  input: "resize_images_3/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_3/Squeeze"
  op: "Squeeze"
  input: "resize_images_3/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_4/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled12.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_4"
  op: "ReadFile"
  input: "ReadFile_4/filename"
}
node {
  name: "DecodeJpeg_4"
  op: "DecodeJpeg"
  input: "ReadFile_4"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_4/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_4/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_4"
  input: "resize_images_4/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_4/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_4/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_4/ExpandDims"
  input: "resize_images_4/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_4/Squeeze"
  op: "Squeeze"
  input: "resize_images_4/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_5/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled13.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_5"
  op: "ReadFile"
  input: "ReadFile_5/filename"
}
node {
  name: "DecodeJpeg_5"
  op: "DecodeJpeg"
  input: "ReadFile_5"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_5/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_5/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_5"
  input: "resize_images_5/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_5/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_5/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_5/ExpandDims"
  input: "resize_images_5/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_5/Squeeze"
  op: "Squeeze"
  input: "resize_images_5/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_6/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled14.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_6"
  op: "ReadFile"
  input: "ReadFile_6/filename"
}
node {
  name: "DecodeJpeg_6"
  op: "DecodeJpeg"
  input: "ReadFile_6"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_6/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_6/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_6"
  input: "resize_images_6/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_6/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_6/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_6/ExpandDims"
  input: "resize_images_6/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_6/Squeeze"
  op: "Squeeze"
  input: "resize_images_6/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_7/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled15.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_7"
  op: "ReadFile"
  input: "ReadFile_7/filename"
}
node {
  name: "DecodeJpeg_7"
  op: "DecodeJpeg"
  input: "ReadFile_7"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_7/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_7/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_7"
  input: "resize_images_7/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_7/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_7/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_7/ExpandDims"
  input: "resize_images_7/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_7/Squeeze"
  op: "Squeeze"
  input: "resize_images_7/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_8/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled16.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_8"
  op: "ReadFile"
  input: "ReadFile_8/filename"
}
node {
  name: "DecodeJpeg_8"
  op: "DecodeJpeg"
  input: "ReadFile_8"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_8/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_8/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_8"
  input: "resize_images_8/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_8/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_8/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_8/ExpandDims"
  input: "resize_images_8/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_8/Squeeze"
  op: "Squeeze"
  input: "resize_images_8/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_9/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled17.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_9"
  op: "ReadFile"
  input: "ReadFile_9/filename"
}
node {
  name: "DecodeJpeg_9"
  op: "DecodeJpeg"
  input: "ReadFile_9"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_9/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_9/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_9"
  input: "resize_images_9/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_9/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_9/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_9/ExpandDims"
  input: "resize_images_9/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_9/Squeeze"
  op: "Squeeze"
  input: "resize_images_9/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_10/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled18.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_10"
  op: "ReadFile"
  input: "ReadFile_10/filename"
}
node {
  name: "DecodeJpeg_10"
  op: "DecodeJpeg"
  input: "ReadFile_10"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_10/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_10/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_10"
  input: "resize_images_10/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_10/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_10/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_10/ExpandDims"
  input: "resize_images_10/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_10/Squeeze"
  op: "Squeeze"
  input: "resize_images_10/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_11/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled19.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_11"
  op: "ReadFile"
  input: "ReadFile_11/filename"
}
node {
  name: "DecodeJpeg_11"
  op: "DecodeJpeg"
  input: "ReadFile_11"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_11/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_11/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_11"
  input: "resize_images_11/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_11/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_11/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_11/ExpandDims"
  input: "resize_images_11/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_11/Squeeze"
  op: "Squeeze"
  input: "resize_images_11/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_12/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled2.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_12"
  op: "ReadFile"
  input: "ReadFile_12/filename"
}
node {
  name: "DecodeJpeg_12"
  op: "DecodeJpeg"
  input: "ReadFile_12"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_12/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_12/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_12"
  input: "resize_images_12/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_12/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_12/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_12/ExpandDims"
  input: "resize_images_12/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_12/Squeeze"
  op: "Squeeze"
  input: "resize_images_12/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_13/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled20.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_13"
  op: "ReadFile"
  input: "ReadFile_13/filename"
}
node {
  name: "DecodeJpeg_13"
  op: "DecodeJpeg"
  input: "ReadFile_13"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_13/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_13/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_13"
  input: "resize_images_13/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_13/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_13/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_13/ExpandDims"
  input: "resize_images_13/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_13/Squeeze"
  op: "Squeeze"
  input: "resize_images_13/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_14/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled21.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_14"
  op: "ReadFile"
  input: "ReadFile_14/filename"
}
node {
  name: "DecodeJpeg_14"
  op: "DecodeJpeg"
  input: "ReadFile_14"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_14/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_14/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_14"
  input: "resize_images_14/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_14/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_14/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_14/ExpandDims"
  input: "resize_images_14/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_14/Squeeze"
  op: "Squeeze"
  input: "resize_images_14/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_15/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled22.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_15"
  op: "ReadFile"
  input: "ReadFile_15/filename"
}
node {
  name: "DecodeJpeg_15"
  op: "DecodeJpeg"
  input: "ReadFile_15"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_15/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_15/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_15"
  input: "resize_images_15/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_15/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_15/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_15/ExpandDims"
  input: "resize_images_15/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_15/Squeeze"
  op: "Squeeze"
  input: "resize_images_15/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_16/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled23.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_16"
  op: "ReadFile"
  input: "ReadFile_16/filename"
}
node {
  name: "DecodeJpeg_16"
  op: "DecodeJpeg"
  input: "ReadFile_16"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_16/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_16/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_16"
  input: "resize_images_16/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_16/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_16/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_16/ExpandDims"
  input: "resize_images_16/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_16/Squeeze"
  op: "Squeeze"
  input: "resize_images_16/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_17/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled24.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_17"
  op: "ReadFile"
  input: "ReadFile_17/filename"
}
node {
  name: "DecodeJpeg_17"
  op: "DecodeJpeg"
  input: "ReadFile_17"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_17/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_17/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_17"
  input: "resize_images_17/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_17/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_17/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_17/ExpandDims"
  input: "resize_images_17/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_17/Squeeze"
  op: "Squeeze"
  input: "resize_images_17/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_18/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled25.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_18"
  op: "ReadFile"
  input: "ReadFile_18/filename"
}
node {
  name: "DecodeJpeg_18"
  op: "DecodeJpeg"
  input: "ReadFile_18"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_18/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_18/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_18"
  input: "resize_images_18/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_18/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_18/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_18/ExpandDims"
  input: "resize_images_18/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_18/Squeeze"
  op: "Squeeze"
  input: "resize_images_18/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_19/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled26.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_19"
  op: "ReadFile"
  input: "ReadFile_19/filename"
}
node {
  name: "DecodeJpeg_19"
  op: "DecodeJpeg"
  input: "ReadFile_19"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_19/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_19/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_19"
  input: "resize_images_19/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_19/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_19/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_19/ExpandDims"
  input: "resize_images_19/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_19/Squeeze"
  op: "Squeeze"
  input: "resize_images_19/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_20/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled27.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_20"
  op: "ReadFile"
  input: "ReadFile_20/filename"
}
node {
  name: "DecodeJpeg_20"
  op: "DecodeJpeg"
  input: "ReadFile_20"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_20/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images_20/ExpandDims"
  op: "ExpandDims"
  input: "DecodeJpeg_20"
  input: "resize_images_20/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_images_20/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "<\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "resize_images_20/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images_20/ExpandDims"
  input: "resize_images_20/size"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_20/Squeeze"
  op: "Squeeze"
  input: "resize_images_20/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ReadFile_21/filename"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "C:/Users/nermi/Desktop/dataset/test/path_forward_scaled28.jpg"
      }
    }
  }
}
node {
  name: "ReadFile_21"
  op: "ReadFile"
  input: "ReadFile_21/filename"
}
node {
  name: "DecodeJpeg_21"
  op: "DecodeJpeg"
  input: "ReadFile_21"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images_21/ExpandDims/dim"
